УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b318cc3-2f5c-4b35-9733-92b8480d218b">
    <name>смартЛогинНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45c407b4-0b68-47cd-a142-a06f4a184f90">
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/смартИдентификаторыСоответствияБитрикс/смартИдентификаторыСоответствияБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e73d00f7-5769-4608-9c25-45cef0769d61">
  <name>смартИдентификаторыСоответствияБитрикс</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="1108660d-814d-4d98-bdc2-94a89bc145c5">
    <name>ГУИД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="b4ff496b-7478-4e3c-a3d5-a8943f81b5e7">
    <name>СсылкаМет</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcf78ec-daf5-4eac-b38c-85fe3f01e92c">
    <name>ИДсайта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/Forms/ФормаЭлемента/Module.bsl
//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 11.03.2021 15:55:55- задача 552
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Элемент = Элементы.Добавить("смартЭлектроннаяПочтаНаСайте", Тип("ПолеФормы"),Элементы.СмартГруппаБитрикс);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.МаксимальнаяШирина=30;
	Элемент.АвтоМаксимальнаяШирина=Ложь;
	Элемент.ПутьКДанным = "Объект.смартЭлектроннаяПочтаНаСайте";
	
	Элемент1 = Элементы.Добавить("смартЛогинНаСайте", Тип("ПолеФормы"),Элементы.СмартГруппаБитрикс);
	Элемент1.Вид = ВидПоляФормы.ПолеВвода;
	Элемент1.МаксимальнаяШирина=30;
	Элемент1.АвтоМаксимальнаяШирина=Ложь;
	Элемент1.ПутьКДанным = "Объект.смартЛогинНаСайте";
	
	Элемент2 = Элементы.Добавить("смартТелефонНаСайте", Тип("ПолеФормы"),Элементы.СмартГруппаБитрикс);
	Элемент2.Вид = ВидПоляФормы.ПолеВвода;
	Элемент2.Заголовок="Телефон на сайте";
	Элемент2.МаксимальнаяШирина=20;
	Элемент2.АвтоМаксимальнаяШирина=Ложь;
	Элемент2.ПутьКДанным = "Объект.смартТелефонНаСайте";

	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элемент.ТолькоПросмотр = Истина;
		Элемент1.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И РольДоступна("ПолныеПрава") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	смартИдентификаторыСоответствияБитрикс.ИДсайта КАК ИДсайта
		|ИЗ
		|	РегистрСведений.смартИдентификаторыСоответствияБитрикс КАК смартИдентификаторыСоответствияБитрикс
		|ГДЕ
		|	смартИдентификаторыСоответствияБитрикс.СсылкаМет = &СсылкаМет";
		
		
		Запрос.УстановитьПараметр("СсылкаМет", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйЭлемент = ЭтаФорма.Элементы.Добавить("смартИдКонтактного", Тип("ДекорацияФормы"),Элементы.ГруппаСвязьСПартнером);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.ЦветТекста=Новый Цвет(0,194,0);
			НовыйЭлемент.Заголовок = ВыборкаДетальныеЗаписи.ИДсайта;
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры
